[Killed] UnaryOperator
src/main/pages/LeaderboardPage.js:58:49
     <div data-testid={"LeaderboardPage-main-div"} style={{backgroundSize: 'cover', backgroundImage: `url(${Background})`}}>
         <BasicLayout>
             <div className="pt-2">
-                <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button"  style={{ float: "right", marginRight: "442px"}}>
+                <Button onClick={() => navigate(+1)} data-testid="LeaderboardPage-back-button"  style={{ float: "right", marginRight: "442px"}}>
                     Back
                 </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] ArrowFunction
src/main/pages/LeaderboardPage.js:58:34
     <div data-testid={"LeaderboardPage-main-div"} style={{backgroundSize: 'cover', backgroundImage: `url(${Background})`}}>
         <BasicLayout>
             <div className="pt-2">
-                <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button"  style={{ float: "right", marginRight: "442px"}}>
+                <Button onClick={() => undefined} data-testid="LeaderboardPage-back-button"  style={{ float: "right", marginRight: "442px"}}>
                     Back
                 </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

<html>
  <head />
