[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:10:30
         {
             Header: 'Cow Price',
             accessor: 'cowPrice', 
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:15:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'Milk Price',
-            accessor: 'milkPrice',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Start Bal',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:18:30
         {
             Header: 'Milk Price',
             accessor: 'milkPrice',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:25:23
         },
         {
             Header: 'Start Bal',
-            accessor: 'startingBalance',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-startingBalance"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:26:30
         {
             Header: 'Start Bal',
             accessor: 'startingBalance',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{formatter.format(props.value)}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:28:43
             accessor: 'startingBalance',
             Cell: (props) => {
                 return (
-                  <div style={{textAlign: "right"}}>{formatter.format(props.value)}</div>)
+                  <div style={{textAlign: ""}}>{formatter.format(props.value)}</div>)
             },
         },
killedBy: ReportHeaderTable tests Has all numeric values right-justified
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:52:23
         },
         {
             Header: 'Degrad Rate',
-            accessor: 'degradationRate',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-degradationRate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:59:21
                   },
         },
         {
-            Header: 'BelowCap',
+            Header: "",
             accessor: 'belowCapacityHealthUpdateStrategy',
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: BelowCap. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m
