[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:15:9
             Header: 'userId',
             accessor: 'userId', 
         },
-        {
-            Header: 'Username',
-            accessor: 'username',
-        },
+        {},
         {
             Header: 'Total Wealth',
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:22:30
         {
             Header: 'Total Wealth',
             accessor: 'totalWealth',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{formatter.format(props.value)}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:51:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   },
         },
-        {
-            Header: 'Cows Sold',
-            accessor: 'cowsSold',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-        },
+        {},
         {
             Header: 'Cow Deaths',
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:61:23
         },
         {
             Header: 'Cow Deaths',
-            accessor: 'cowDeaths',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-cowDeaths"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
