[Killed] ObjectLiteral
main/components/Reports/ReportTable.js:41:9
             Header: 'Create Date',
             accessor: 'createDate',
         },
-        {
-            Header: 'Num Users',
-            accessor: 'numUsers',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Num Cows',
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportTable.js:60:50
     ];
 
     if (buttons) {
-        columns.push(ButtonColumn("View Report", "secondary", reportCallback, testid));
+        columns.push(ButtonColumn("View Report", "", reportCallback, testid));
     }
     return <OurTable
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(element).toHaveClass("btn-secondary")

Expected the element to have class:
  btn-secondary
Received:
  btn
