[Killed] ArrowFunction
main/components/Commons/ManageCows.js:44:46
                             <Col className="text-center">
                                 <Button
                                     variant="outline-success"
-                                    onClick={() => onBuy(userCommons)}
+                                    onClick={() => undefined}
                                     data-testid={"buy-cow-button"}
                                 >
killedBy: AdminViewPlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Commons/ManageCows.js:53:46
                             <Col className="text-center">
                                 <Button
                                     variant="outline-danger"
-                                    onClick={() => onSell(userCommons)}
+                                    onClick={() => undefined}
                                     data-testid={"sell-cow-button"}
                                 >
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}

Number of calls: 0

<html>
  <head />
