[Killed] BlockStatement
src/main/pages/AdminViewPlayPage.js:91:33
         mutationbuy.mutate(userCommons);
     };
 
-    const onSuccessSell = () => {
-        toast(`Cow sold!`);
-    };
+    const onSuccessSell = () => {};
 
     // Stryker disable all
killedBy: AdminViewPlayPage tests click buy and sell buttons
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow sold!"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.js:125:16
     };
 
     const chatButtonStyle = {
-        width: "40px",
+        width: "",
         height: "40px",
         borderRadius: "50%",
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 50%;
  bottom: 20px;
  color: black;

[Killed] LogicalOperator
src/main/pages/AdminViewPlayPage.js:191:18
                 style={chatContainerStyle}
                 data-testid="adminviewplaypage-chat-div"
             >
-                {!!isChatOpen && <ChatPanel commonsId={userId} />}
+                {!!isChatOpen || <ChatPanel commonsId={userId} />}
                 <Button
                     style={chatButtonStyle}
killedBy: AdminViewPlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()
