[Killed] ConditionalExpression
src/main/pages/LeaderboardPage.js:60:9
     const navigate = useNavigate();
 
     const showLeaderboard =
-        hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard;
+        true;
     return (
         <div
killedBy: LeaderboardPage tests renders leaderboard error message for users when showLeaderboard = false
statusReason: Error: Unable to find an element with the text: You're not authorized to see the leaderboard.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="LeaderboardPage-main-div"
      style="background-size: cover; background-image: url(PlayPageBac

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:63:26
         hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard;
     return (
         <div
-            data-testid={"LeaderboardPage-main-div"}
+            data-testid={""}
             style={{
                 backgroundSize: "cover",
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: Unable to find an element by: [data-testid="LeaderboardPage-main-div"]

<body>
  <div>
    <div
      data-testid=""
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ArrowFunction
src/main/pages/LeaderboardPage.js:82:47
                                 <input
                                     type="number"
                                     value={playPageId}
-                                    onChange={(e) =>
-                                        setPlayPageId(e.target.value)
+                                    onChange={() => undefined
                                     }
                                     className="form-control mr-2"
killedBy: LeaderboardPage tests should update playPageId when input value changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:89:43
                                     placeholder="Enter User ID to visit"
                                 />
                                 <Button
-                                    href={`/admin/play/${commonsId}/user/${playPageId}`}
+                                    href={``}
                                     data-testid="LeaderboardPage-play-page-button"
                                 >
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: expect(element).toHaveAttribute("href", "/admin/play/1/user/1") // element.getAttribute("href") === "/admin/play/1/user/1"

Expected the element to have attribute:
  href="/admin/play/1/user/1"
Received:
  href=""
