[Killed] StringLiteral
src/main/pages/PlayPage.js:121:26
         width: "40px",
         height: "40px",
         borderRadius: "50%",
-        backgroundColor: "lightblue",
+        backgroundColor: "",
         color: "black",
         position: "fixed",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: lightblue;
+ background-color: ButtonFace;
  border-radius: 50%;
  bottom: 20px;

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:146:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {true}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:153:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
-                        <CardGroup>
-                            <ManageCows
-                                userCommons={userCommons}
-                                commons={commonsPlus.commons}
-                                onBuy={onBuy}
-                                onSell={onSell}
-                            />
-                            <FarmStats userCommons={userCommons} />
-                            <Profits
-                                userCommons={userCommons}
-                                profits={userCommonsProfits}
-                            />
-                        </CardGroup>
-                    )}
+                    {!!userCommons && !!commonsPlus || <CardGroup>
+                            <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
+                            <FarmStats userCommons={userCommons} />
+                            <Profits userCommons={userCommons} profits={userCommonsProfits} />
+                        </CardGroup>}
                 </Container>
             </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:153:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
-                        <CardGroup>
-                            <ManageCows
-                                userCommons={userCommons}
-                                commons={commonsPlus.commons}
-                                onBuy={onBuy}
-                                onSell={onSell}
-                            />
-                            <FarmStats userCommons={userCommons} />
-                            <Profits
-                                userCommons={userCommons}
-                                profits={userCommonsProfits}
-                            />
-                        </CardGroup>
-                    )}
+                    {false}
                 </Container>
             </BasicLayout>
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
