[Killed] StringLiteral
main/components/Commons/ManageCows.js:45:52
                                 <Button
                                     variant="outline-success"
                                     onClick={() => {
-                                        setMessage("buy");
+                                        setMessage("");
                                         openModal();
                                     }}
killedBy: ManageCows tests calls setMessage with "buy" when the buy button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "buy"
Received: ""

Number of calls: 1

[Killed] StringLiteral
main/components/Commons/ManageCows.js:57:52
                                 <Button
                                     variant="outline-danger"
                                     onClick={() => {
-                                        setMessage("sell");
+                                        setMessage("");
                                         openModal();
                                     }}
killedBy: ManageCows tests calls setMessage with "sell" when the sell button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "sell"
Received: ""

Number of calls: 1
