[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.js:100:22
                 </Card>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"
      >

[Killed] LogicalOperator
src/main/pages/AdminViewPlayPage.js:100:22
                 </Card>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {!!commonsPlus || <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/AdminViewPlayPage.js:107:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
+                    {!!userCommons || !!commonsPlus && (
                         <CardGroup data-testid="adminviewplaypage-card-group">
                             <ManageCows
killedBy: AdminViewPlayPage tests renders when userCommons is falsy but commonsPlus is truthy
statusReason: Error: expect(element).toBeInTheDocument()

element could not be found in the document
