[Killed] StringLiteral
src/main/pages/PlayPage.js:133:26
         width: "60px",
         height: "60px",
         borderRadius: "25%",
-        backgroundColor: "lightblue",
+        backgroundColor: "",
         color: "black",
         position: "fixed",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: lightblue;
+ background-color: ButtonFace;
  border-radius: 25%;
  bottom: 30px;

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:162:22
         >
             <BasicLayout>
                 <Container>
-                    {!!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {true}
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:163:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
