[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:19:9
                 return <Link to={url}>{row.username}</Link>;
             },
         },
-        {
-            Header: "Total Wealth",
-            id: "totalWealth",
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.totalWealth);
-            },
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
-        },
+        {},
         {
             Header: "Cows Owned",
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:25:30
             accessor: (row, _rowIndex) => {
                 return USD.format(row.totalWealth);
             },
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:58:21
             },
         },
         {
-            Header: "Cow Deaths",
+            Header: "",
             accessor: "cowDeaths",
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cow Deaths. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;
