[Killed] BlockStatement
src/main/pages/PlayPage.js:99:43
   // Stryker restore all 
 
 
-  const onBuy = (userCommons, numCows) => {
-    mutationbuy.mutate(userCommons, numCows)
-  };
+  const onBuy = (userCommons, numCows) => {};
 
 
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] BlockStatement
src/main/pages/PlayPage.js:130:44
   // Stryker restore all 
 
 
-  const onSell = (userCommons, numCows) => {
-    mutationsell.mutate(userCommons, numCows)
-  };
+  const onSell = (userCommons, numCows) => {};
 
   const [isChatOpen, setIsChatOpen] = useState(false);
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] StringLiteral
src/main/pages/PlayPage.js:145:12
     height: '60px',
     borderRadius: '25%',
     backgroundColor: 'lightblue',
-    color: 'black',
+    color: "",
     position: 'fixed',
     bottom: '30px',
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 25%;
  bottom: 30px;
- color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:147:13
     backgroundColor: 'lightblue',
     color: 'black',
     position: 'fixed',
-    bottom: '30px',
+    bottom: "",
     right: '30px',
   };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 25%;
- bottom: 30px;
  color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:148:12
     color: 'black',
     position: 'fixed',
     bottom: '30px',
-    right: '30px',
+    right: "",
   };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 25%;
  bottom: 30px;
  color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:154:13
   const chatContainerStyle = {
     width: '550px',
     position: 'fixed',
-    bottom: '100px',
+    bottom: "",
     right: '20px',
   };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- bottom: 100px;
  position: fixed;
  right: 20px;
  width: 550px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:155:12
     width: '550px',
     position: 'fixed',
     bottom: '100px',
-    right: '20px',
+    right: "",
   };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 100px;
  position: fixed;
- right: 20px;
  width: 550px;

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:158:22
     right: '20px',
   };
 
-  const emojiStyle = {
-    fontFamily: 'Arial, sans-serif', 
-    fontSize: '30px', 
-
-  };
+  const emojiStyle = {};
 
   return (
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- font-family: Arial, sans-serif;

[Killed] StringLiteral
src/main/pages/PlayPage.js:160:15
 
   const emojiStyle = {
     fontFamily: 'Arial, sans-serif', 
-    fontSize: '30px', 
+    fontSize: "", 
 
   };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- font-size: 30px;

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:184:12
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
         {!!isChatOpen && <ChatPanel commonsId={commonsId}/>}
         <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
-          {!!isChatOpen ? <span style={emojiStyle} data-testid="close-icon">❌</span> : <span style={emojiStyle} data-testid="message-icon">💬</span>}
+          {!isChatOpen ? <span style={emojiStyle} data-testid="close-icon">❌</span> : <span style={emojiStyle} data-testid="message-icon">💬</span>}
         </Button>
       </div>
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  💬
Received:
  ❌
