[Killed] BlockStatement
main/components/Commons/ManageCows.js:17:68
             <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
             <Row>
                 <Col className="text-center">
-                    <Button variant="outline-success" onClick={()=>{setMessage('buy'); openModal();}} data-testid={"buy-cow-button"}>Buy cows</Button>
+                    <Button variant="outline-success" onClick={()=>{}} data-testid={"buy-cow-button"}>Buy cows</Button>
                 </Col>
                 <Col className="text-center">
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] StringLiteral
main/components/Commons/ManageCows.js:17:116
             <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
             <Row>
                 <Col className="text-center">
-                    <Button variant="outline-success" onClick={()=>{setMessage('buy'); openModal();}} data-testid={"buy-cow-button"}>Buy cows</Button>
+                    <Button variant="outline-success" onClick={()=>{setMessage('buy'); openModal();}} data-testid={""}>Buy cows</Button>
                 </Col>
                 <Col className="text-center">
killedBy: ManageCows tests calls setMessage with "buy" when the buy button is clicked
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] BlockStatement
main/components/Commons/ManageCows.js:20:67
                     <Button variant="outline-success" onClick={()=>{setMessage('buy'); openModal();}} data-testid={"buy-cow-button"}>Buy cows</Button>
                 </Col>
                 <Col className="text-center">
-                    <Button variant="outline-danger" onClick={()=>{setMessage('sell'); openModal();}} data-testid={"sell-cow-button"}>Sell cows</Button>
+                    <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-cow-button"}>Sell cows</Button>
                 </Col>
             </Row>
killedBy: ManageCows tests calls setMessage with "sell" when the sell button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "sell"

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/ManageCows.js:20:116
                     <Button variant="outline-success" onClick={()=>{setMessage('buy'); openModal();}} data-testid={"buy-cow-button"}>Buy cows</Button>
                 </Col>
                 <Col className="text-center">
-                    <Button variant="outline-danger" onClick={()=>{setMessage('sell'); openModal();}} data-testid={"sell-cow-button"}>Sell cows</Button>
+                    <Button variant="outline-danger" onClick={()=>{setMessage('sell'); openModal();}} data-testid={""}>Sell cows</Button>
                 </Col>
             </Row>
killedBy: ManageCows tests calls setMessage with "sell" when the sell button is clicked
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sell-cow-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5
