[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:5:38
 import {Modal, Button, Form} from 'react-bootstrap'
 
 const ManageCowsModal = ({number, setNumber, isOpen, onClose, message, userCommons, onBuy, onSell }) => {
-    const handleInputChange = (e) => {
-        setNumber(e.target.value);
-    };
+    const handleInputChange = (e) => {};
 
     const handleSubmit = (e) => {
killedBy: ManageCowsModal updates the number state on input change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "10"

Number of calls: 0

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:9:33
         setNumber(e.target.value);
     };
 
-    const handleSubmit = (e) => {
-      e.preventDefault();
-      if (message.includes('buy')) {
-          onBuy(userCommons, number)
-      }
-      else {
-          onSell(userCommons, number)
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    };
+    const handleSubmit = (e) => {};
 
     const handleClose = () => {
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:11:11
 
     const handleSubmit = (e) => {
       e.preventDefault();
-      if (message.includes('buy')) {
+      if (true) {
           onBuy(userCommons, number)
       }
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked
statusReason: TypeError: onBuy is not a function

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:11:36
 
     const handleSubmit = (e) => {
       e.preventDefault();
-      if (message.includes('buy')) {
-          onBuy(userCommons, number)
-      }
+      if (message.includes('buy')) {}
       else {
           onSell(userCommons, number)
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:26:9
       onClose();
     }
 
-    if (!isOpen) {
+    if (true) {
         return null;
     }
killedBy: ManageCowsModal renders the modal when isOpen is true
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.js:34:34
     <Modal data-testid={"buy-sell-cow-modal"} show={isOpen} onHide={handleClose}>
       <Modal.Body>
         <Form onSubmit={handleSubmit}>
-        <Form.Group data-testid={"buy-sell-cow-modal-closeGroup"} style={{display: 'flex', justifyContent: 'right'}}>
+        <Form.Group data-testid={""} style={{display: 'flex', justifyContent: 'right'}}>
                 <span aria-hidden="true">&times;</span>
killedBy: ManageCowsModal Check styling of modal components
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-sell-cow-modal-closeGroup"]

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div />
