[Killed] StringLiteral
main/components/Commons/CommonsForm.js:40:20
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
         name: "", startingBalance: "10000", cowPrice: "100",
-        milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today, lastDate: nextMonth
+        milkPrice: "", degradationRate: 0.001, carryingCapacity: 100, startingDate: today, lastDate: nextMonth
     };
 
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:43:27
         milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today, lastDate: nextMonth
     };
 
-    const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const belowStrategy = initialCommons.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
     const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'belowCapacityStrategy')

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:44:27
     };
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const aboveStrategy = initialCommons?.aboveCapacityStrategy && healthUpdateStrategies?.defaultAboveCapacity;
 
     return (
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null
